[
	{
		"quote": "No, Dany. Dany, tell them. Make them! Dany, make them... No, you can't! Just-- please! ''Dany, please!",
		"who": "Viserys Targaryen",
		"source": "Episode 1x6",
		"note": "After threatening Daenerys to try and force Khal Drogo to help him gain his crown, character is restrained by Khal Drogo's guards and begs Daenerys to call them off. Daenerys watches impassively as Khal Drogo 'crowns' Viserys with a pot of molten gold, killing him."
	},
	{
		"quote": "Forgive me, Lord.",
		"who": "Will",
		"source": "Episode 1x1,",
		"note": "Character has just been apprehended as a deserter of the Night's Watch. Though he apologises to Ned Stark, aware of the consequences of his actions, he affirms that he saw White Walkers beyond the Wall. The words above are a final whispered utterance to both himself and his liege, and he is beheaded for his crime."
	},	
	{
		"quote": "You're not supposed to be here. No one's supposed to be here. It's a mercy, he's dead already.",
		"who": "Unnamed assassin",
		"source": "Episode 1x2",
		"note": "Spoken to Catelyn Stark, upon seeing that she is in the room with his target, her comatose son Bran. After struggling with Catelyn, his throat is ripped out by Bran's direwolf, Summer."
	},	
	{
		"quote": "If you threaten my lord again...",
		"who": "Jory Cassell",
		"source": "Episode 1x5",
		"note": "Ned Stark and his retinue of bannermen have been surrounded by Jaime Lannister and his guards, spurred into action by news of Tyrion's capture. Character says the above after Jaime attempts to intimidate his liege, and he is killed after he singles Jaime out in the fight that follows, with his opponent swiftly plunging a dagger into his eye."
	},
	{
		"quote": "My memory...hehe. King Robert Baratheon...murdered by a pig. Give me something for the pain, and let me die.'",
		"who": "King Robert Baratheon",
		"source": "Episode 1x7",
		"note": "Character has been mortally wounded by a boar he was hunting. He clings to life long enough to entrust his kingdom to the regency of his friend Ned Stark until his 'son' Joffrey comes of age. Ned knows that Joffrey is in fact not Robert's child, but cannot bring himself to hurt his friend on his deathbed with the truth."
	},
	{
		"quote": "What do we say to the god of death?",
		"who": "Syrio Forel",
		"source": "Episode 1x8",
		"note": "Spoken after fighting off four Lannister guardsmen to protect Arya Stark, before finally being disarmed by Ser Meryn Trant. He refuses to flee with Arya, and instead utters this line, harkening back to an earlier lesson. Arya responds correctly with 'Not today' and makes her escape. Syrio is presumed dead, but his final fate is not shown."
	},
	{
		"quote": "My horse...blood of my blood...no, I must ride.",
		"who": "Khal Drogo",
		"source": "Episode 1x9,",
		"note": "Character has become deathly ill from an infected wound and fallen from his horse, which among the Dothraki means he is no longer fit to be Khal. He slips further into fever and delirium, prompting Daenerys to order Mirri Maz Duur to save him with blood magic. Mirri's ritual, however, only returns character to a catatonic state despite killing his and Daenerys' unborn child. Seeing that character has no hope of recovery, Daenerys smothers him with a pillow."
	},
	{
		"quote": "I am Eddard Stark, Lord of Winterfell and Hand of the King. I come before you to confess my treason in the sight of gods and men.' I betrayed the faith of my king and the trust of my friend, Robert. I swore to protect and defend his children, but before his blood was cold, I plotted to murder his son and seize the throne for myself. Let the High Septon and Baelor the Blessed bear witness to what I say: Joffrey Baratheon is the one true heir to the Iron Throne, by the grace of all the gods, Lord of the Seven Kingdoms and Protector of the Realm.",
		"who": "Eddard Stark",
		"source": "Episode 1x9,",
		"note": "Eddard falsely confesses to treason in order to save his daughters, though he has also been promised his own life will be spared. Joffrey breaks this promise and orders that Ned be beheaded."
	},
	{
		"quote": "You will not hear me scream!",
		"who": "Mirri Maz Duur",
		"source": "Episode 1x10,",
		"note": "After character betrays Daenerys, causing the deaths of Khal Drogo as well as Daenerys' unborn child, character says the above as Daenerys binds her to Khal Drogo's funeral pyre."
	},
	{
		"quote": "A cup of wine to honor the one true god.",
		"who": "Maester Cressen",
		"source": "Episode 2x1,",
		"note": "Character, disturbed by the amount of influence Melisandre is holding over Stannis, to the point of having him renounce his old religion, plans to commit murder-suicide for the sake of his lord; at a gathering, offering to set aside differences in order to make up for speaking out against her, he discreetly poisons a cup of wine and drinks it first. As the poison takes effect, he watches Melisandre drink the rest of the cup unaffected, and he collapses soon after."
	},
	{
		"quote": "I've always hated crossbows. ''Take too long to load!''",
		"who": "Yoren",
		"source": "Episode 2x3",
		"note": "Character, a Night's Watch recruiter, has been confronted by Lannister soldiers looking for Gendry, a boy in Yoren's caravan. After refusing to disarm, and being shot by a Lannister crossbow, he says this line, charging the Lannister soldiers as he shouts the second part. Ultimately he is overpowered and executed by the leader of the soldiers, Ser Amory Lorch."
	},
	{
		"quote": "No. You'll have to carry me.",
		"who": "Lommy Greenhands",
		"source": "Episode 2x3",
		"note": "Character, a teenage Night's Watch recruit, has been wounded in a fight with Lannister soldiers and taken captive along with Arya, Hot Pie, and Gendry. When asked by Polliver, a Lannister soldier, if he can walk, he responds with the above line. He is then killed out of hand by Polliver, who mocks character's request to be carried by his captors."
	},
	{
		"quote": "Please bring my terms to your son. I believe we are natural allies, I hope he feels the same. Together, we can end this war in a fortnight.",
		"who": "Renly Baratheon",
		"source": "Episode 2x5",
		"note": "Negotiating the terms of an alliance with Catelyn Stark, character is then stabbed by a shadow creature birthed earlier by Melisandre."
	},
	{
		"quote": "Hush now, child. I'm off to see your father. Gods help you, Theon Greyjoy. Now you are truly lost.",
		"who": "Ser Rodrik Cassel",
		"source": "Episode 2x6",
		"note": "Character is about to be executed by Theon Greyjoy for openly disrespecting him after Theon captures Winterfell. Character says the first line to calm a frantic Bran Stark, referring to Ned Stark who was killed in Season 1. He then addresses the final line to Theon himself, who had been raised by character and the rest of the Stark household as a ward."
	},
	{
		"quote": "Tell me.",
		"who": "Alton Lannister",
		"source": "Episode 2x7",
		"note": "Character, conversing with a captive Jaime, inquries about whether or not Jaime has thought about trying to escape. He responds that he has, yet he didn't think he could until then, and character asks what he can do to help. Jaime subsequently beats him to death to attract the attention of his jailer."
	},
	{
		"quote": "There's only one ship.",
		"who": "Matthos Seaworth",
		"source": "Episode 2x9",
		"note": "The crew on board Davos' ship see a lone vessel of the Royal Fleet heading towards their armada. Character makes the above comment before they discover the ship is unmanned, but leaking wildfire. The flotilla attempts to steer away, but a flaming arrow ignites the wildfire and engulfs the fleet in flames, with Matthos being killed as the explosion hurls him overboard."
	},
	{
		"quote": "Do it quickly.",
		"who": "Maester Luwin",
		"source": "Episode 2x10",
		"note": "Character has been mortally wounded by Dagmer Cleftjaw in the Ironborn's betrayal of Theon. Content in seeing Bran and Rickon alive, he urges them to go north to the Wall to meet Jon and tasks Osha with protecting them. Osha asks for the milk of the poppy to ease his pain but he refuses, imploring that she kill him out of mercy instead."
	},
	{
		"quote": "They will be waiting a long time.",
		"who": "Pyat Pree",
		"source": "Episode 2x10",
		"note": "Character has welcomed Daenerys Targaryen 'home' as he chains her inside the House of the Undying. Daenerys responds that her home is across the sea where her people are waiting for her. Character responds with the above line, after which Daenerys commands her dragons to incinerate him."
	},
	{
		"quote": "I'll chop the hands off the next man who calls me bastard!",
		"who": "Craster",
		"source": "Episode 3x4",
		"note": "Character has just been insulted by the Night's Watch men he is sheltering, who have become fed up with the meager food they've been given and Craster's remarks about their wounded. Karl, a Night's Watch brother finally pushed beyond the breaking point, deliberately calls character a bastard again. Craster lunges at Karl, but is fatally stabbed by him."
	},															
	{
		"quote": "Unhand her. I shall have your head for this!",
		"who": "Lord Commander Jeor Mormont",
		"source": "Episode 3x4",
		"note": "Character has just watched one of his Night's Watch men, Karl, kill their host Craster (see above). Karl then grabs one of Craster's daughter-wives, demanding to know where their food is hidden, prompting the above line. Character moves to fight Karl, but is stabbed in the back by another disgruntled Night's Watch brother, Rast."
	},	
	{
		"quote": "I am your master! Kill her! Kill her! Kill her!'",
		"who": "Kraznyz mo Nakloz",
		"source": "Episode 3x4,",
		"note": "Character has just traded 8,000 Unsullied slave soldiers to Daenerys Targaryen for her dragon, Drogon. Daenerys orders the Unsullied to kill all the slavers in Astapor and free their slaves. Character speaks the above, trying to order the Unsullied to kill Daenerys, but they ignore him since he is no longer their owner. Daenerys then orders Drogon (whose loyalty cannot be bought or traded) to incinerate character."
	},	
	{
		"quote": "Is this a rescue? Are we...",
		"who": "Willem Lannister",
		"source": "Episode 3x5,",
		"note": "Character, a nephew of Tywin and a captive of Robb's forces, is killed by Rickard Karstark and his bannermen in retaliation for his son's death at the hands of Jaime in the previous season."
	},
	{
		"quote": "Please, I didn't do anything! I'm just a squire, please!",
		"who": "Martyn Lannister",
		"source": "Episode 3x5",
		"note": "Character, a nephew of Tywin and a captive of Robb's forces, is killed by Rickard Karstark and his bannermen in retaliation for his son's death at the hands of Jaime in the previous season."
	},
	{
		"quote": "Kill me, and be cursed. You are no king of mine.",
		"who": "Rickard Karstark",
		"source": "Episode 3x5",
		"note": "As vengeance for his sons' death, Karstark murders two captive Lannister boys; Robb executes him for treason. Character reminds Robb that they are distantly related, not because he thinks it will save him, but as a taunt: killing a member of your own family is one of the most damning sins in their shared religion."
	},
	{
		"quote": "Eddard. Don't you want to teach little Ned Stark how to ride horses?",
		"who": "Queen Talisa",
		"source": "Episode 3x9",
		"note": "After giving her husband, Robb Stark, the news that she is pregnant, character proposes the name Eddard if the child is a boy. Shortly afterward, she is stabbed repeatedly in the stomach by Lothar Frey, the first victim of the Red Wedding's bloodshed."
	},
	{
		"quote": "On my honor as a Tully, on my honor as a Stark, LET HIM GO, or I will cut your wife's throat!",
		"who": "Catelyn Stark",
		"source": "Episode 3x9,",
		"note": "In the midst of the carnage of the Red Wedding, character siezes Lord Walder Frey's young wife, Joyeuse, and holds her at knifepoint in a desperate attempt to bargain for the life of her son, Robb. Lord Walder casually responds that he'll find another wife, and Roose Bolton delivers the final blow to Robb, stabbing him through the heart. Catelyn then carries out her threat, and stares in horror at her son's body for a moment before her throat is cut in turn by Black Walder Frey."
	},
	{
		"quote": "Mother.",
		"who": "Robb Stark",
		"source": "Episode 3x9",
		"note": "Character has just been wounded by crossbow bolts during the Red Wedding, and is now witnessing his mother, Catelyn holding Walder Frey's wife at knifepoint to barter for his life. Immediately afterward, he is stabbed through the heart by Roose Bolton."
	},
	{
		"quote": "Carry me?",
		"who": "Polliver",
		"source": "Episode 4x1",
		"note": "Character is being held at swordpoint by Arya Stark, who plans to kill him as revenge for killing her friend (see Lommy Greenhands, S2E3) and taking her sword, Needle. Arya repeats the lines character had said during the above deeds. Character initially doesn't recognize Arya and utters the above in confusion, but realizes the truth as Arya continues her recitation. Arya then stabs him through the neck with Needle, just as Polliver had done to Lommy."
	},
	{
		"quote": "No.'[begins coughing]'' 'No. You'll wait here un...' ''[continues coughing more forcefully]'' ''[Tyrion: Your Grace?]'' 'It's nothing.' ''[continues coughing and gasping uncontrollably]''",
		"who": "Joffrey Baratheon",
		"source": "Episode 4x2,",
		"note": "After drinking the wine he ordered his uncle Tyrion to serve him, character begins coughing and gasping uncontrollably. He chokes to death immediately thereafter, apparently the victim of poison."
	},
	{
		"quote": "Keep talking, and I'll cut your friends' throats. Starting with the idiot. Do you hear? ''Do you hear?'' '",
		"who": "Locke",
		"source": "Episode 4x5",
		"note": "Character is attempting to smuggle Bran Stark out of Craster's Keep in order to kill him, on Roose Bolton's orders. He intimidates Bran into silence by threatening his companions, however Bran wargs into Hodor's body, breaks Hodor free, and then kills character by snapping his neck."
	},
	{
		"quote": "You know what's wrong with honor?'",
		"who": "Karl",
		"source": "Episode 4x5",
		"note": "Character, a Night's Watch mutineer, is dueling Jon Snow, who has arrived to kill him and his fellow mutineers. He taunts Jon about his castle-taught 'honorable' fighting style, concluding with the above as he knocks Jon down and disarms him. Character is then stabbed from behind by one of Craster's former wives, whom he and the mutineers had abused since killing Craster. He turns to confront the girl, but is promptly stabbed through the head by Jon."
	},
	{
		"quote": "Rorge.",
		"who": "Rorge",
		"source": "Episode 4x7",
		"note": "After a failed attempt to kill the Hound, character is recognized by Arya Stark as an enemy from her journey in Yoren's caravan. The Hound asks Arya if character is on her 'hit list', and she replies he isn't because she doesn't know his name. The Hound asks character his name, prompting the above reply. Arya promptly thanks character, draws her sword, and stabs him through the heart."
	},
	{
		"quote": "You want her. This empty-headed child.' [Petyr Baelish: Let her go.] 'She's just like her mother, she'll never love you. I ''lied'' for you, I ''killed'' for you. Why did you bring her here, ''why''?'",
		"who": "Lysa Arryn",
		"source": "Episode 4x7",
		"note": "After seeing Baelish kiss Sansa Stark, character has gone mad with jealousy and is dangling Sansa over the Moon Door, believing she is trying to steal Petyr. Petyr intervenes, asking character to let Sansa go, prompting the above, and character finally releases Sansa after Petyr promises to send her away. Petyr moves to comfort character, swearing that he's only loved one woman in all of his life. He then proclaims that woman to be Lysa's sister (Catelyn Stark), and shoves character out of the Moon Door."
	},
	{
		"quote": "Wait. Are you dying? No, no, no. You can't die yet. You haven't confessed. Say it. Say her name. Elia Martell. You raped her. You killed her children. ''Elia Martell''. Who gave you the order?' ''[points toward Tywin Lannister]'' ' ''Who gave you the order?!'' ''Say her name! You raped her! You murdered her! You killed her children.'' Say it. Say her name. Say it!'",
		"who": "Oberyn Martell",
		"source": "Episode 4x8,",
		"note": "Character is fighting Ser Gregor Clegane in Tyrion's trial by combat to gain revenge for Clegane murdering character's sister and her children. After seemingly defeating Clegane, character demands he confess to his crimes. As character approaches, Clegane knocks him off his feet and kills him by crushing his skull."
	},
	{
		"quote": "Elia Martell. I killed her children. Then I raped her. Then I smashed her head in ''like this!'''",
		"who": "Gregor Clegane",
		"source": "Episode 4x8",
		"note": "Character, gravely wounded by Oberyn Martell in Tyrion's trial by combat, manages to catch his opponent off guard as he attempts to force him to confess to murdering his sister and her children. He trips him up, knocks out his teeth and gouges out his eyes while saying the above, and crushes his skull. Despite being severely poisoned, character is taken to Qyburn who transforms him into a knight of the Kingsguard, who has ostensibly vowed never to speak until all enemies of the realm have been vanquished - technically, hence, these are his last words as a whole man."
	},
	{
		"quote": "I got one! Right through the heart, he's dead.' [Samwell: Is it over?] 'No...' [Samwell: Well then...]",
		"who": "Pyp",
		"source": "Episode 4x9",
		"note": "Character has been defending the gate with a crossbow alongside Samwell. After he exalts over finally hitting and killing a wildling, Samwell reminds him that the battle is far from over and hands him another loaded crossbow. As character rises to find a new target, he is shot through the throat by Ygritte."
	},															
	{
		"quote": "I am the sword in the darkness! I am the watcher on the walls! I am the shield that guards the realms of men! I pledge my life and honor to the Night's Watch for this night, and all the nights to come!",
		"who": "Grenn",
		"source": "Episode 4x9",
		"note": "Character, along with five other men of the Night's Watch, had been instructed to hold a crucial gate against enemy attack. As a giant begins to charge the gate, Grenn leads the others in a recitation of the Night's Watch oath, finishing just as the giant reaches them. All six men are later found dead, their corpses surrounding the slain giant."
	},	
	{
		"quote": "You know nothing, Jon Snow.",
		"who": "Ygritte",
		"source": "Source: Episode 4x9,",
		"note": "After being mortally wounded during the fight for Castle Black, character is being held in the arms of Jon Snow, her former lover. After Jon tries to assure her that she will be alright, and that they will still return to the cave where they first made love, character utters the above before dying in Jon's arms. The above line had become a running joke between the two, often used by Ygritte to express Jon's ignorance of a subject."
	},
	{
		"quote": "Go with them.",
		"who": "Jojen Reed",
		"source": "Episode 4x10",
		"note": "After being attacked and mortally wounded by wights, character implores his sister, Meera, to flee with Bran and Hodor to safety. Character is then mercy-killed by Meera and his body burned by a Child of the Forest to prevent him from being resurrected as another wight."
	},
	{
		"quote": "Tywin...?'",
		"who": "Shae",
		"source": "Episode 4x10",
		"note": "Character has been angrily confronted by his son, Tyrion, for falsely convicting him of Joffrey's murder and sentencing him to death. Tyrion shoots character with his crossbow, prompting the above. Tyrion replies that he has always been Tywin's son, and then shoots him again, this time fatally."
	},
	{
		"quote": "You shot me. You're no son of mine.",
		"who": "Tywin Lannister",
		"source": "Episode 4x10",
		"note": "Tywin was a shit."
	},
	{
		"quote": "I wish you good fortune in the wars to come.",
		"who": "Mance Rayder",
		"source": "Episode 5x1",
		"note": "Character says this to Stannis Baratheon before he is to be executed by being burned alive on a pyre. Before the flames engulf character, Jon Snow shoots him through the heart with an arrow to end his suffering."
	},
	{
		"quote": "'I was wrong! You're the Lord Commander! We all serve you! I'm sorry! Not only for this, for all I've done and said! I was wrong! My lord, please, mercy! Mercy! I'll go, I will! Please.......I'm afraid........I've always been afraid.......'",
		"who": "Janos Slynt",
		"source": "Episode 5x3",
		"note": "After repeatedly and publicly refusing to follow the orders of the new Lord Commander, Jon Snow, character is arrested and sentenced to death. He pleads for mercy, but is executed by Jon himself."
	},
	{
		"quote": "Your Grace.",
		"who": "Ser Barristan Selmy",
		"source": "Episode 5x4",
		"note": "Character has just told Daenerys a story of her older brother, Rhaegar, and his love of singing. Dany then tells him to go out into the city and sing a song for her. Character responds with the above and departs; shortly thereafter, he is killed during an ambush set by the Sons of the Harpy."
	},
	{
		"quote": "Egg...I dreamed...that I was old.",
		"who": "Maester Aemon",
		"source": "Episode 5x7",
		"note": "Character, dying of old age, believes in his delirium that he is talking to his younger brother, Aegon (Egg). He then dies peacefully with Sam and Gilly at his side (the first death by natural causes seen in the series)."
	},
	{
		"quote": "Your Grace, your Grace! Come with me, I know a way out.",
		"who": "Hizdahr zo Loraq",
		"source": "Episode 5x9 ",
		"note": "As the Sons of the Harpy attempt to assassinate Daenerys at Daznak's Pit, character tries to lead her and her entourage to an escape route. He is then immediately seized and stabbed to death by several Sons."
	},
	{
		"quote": "Go on, do your duty.",
		"who": "Stannis Baratheon",
		"source": "Episode 5x10 ",
		"note": "After his army has been destroyed in battle by the forces of Roose and Ramsay Bolton, character is found by Brienne of Tarth, who had sworn to kill him for the murder of Renly Baratheon (Episode 2x5). Character confesses to Renly's murder, after which Brienne prepares to execute him in Renly's name, as one of his Kingsguard. Character replies with the above. Brienne appears to execute him, though exactly what happens next is not shown."
	},
	{
		"quote": "Reek! Please! ''Stop!'' ",
		"who": "Myranda",
		"source": "Episode 5x10",
		"note": "Character, along with Theon, has caught Sansa attempting to escape Winterfell, and threatens to mutilate her as punishment. After describing the future horrors in store for Sansa, character prepares to shoot her with an arrow to begin the torture. However, Theon, unable to bear any more, suddenly grabs character, prompting the above as he throws her off the walls of Winterfell to her death."
	},
	{
		"quote": "I can see I have my work cut out for me. You two, out.",
		"who": "Ser Meryn Trant",
		"source": "Episode 5x10 ",
		"note": "Character is choosing between three young girls in a brothel, and chooses the one who refuses to cry out when he hits her. The girl, actually Arya Stark wearing another face, then reveals herself and attacks character, putting out both his eyes and stabbing him repeatedly. Arya then reminds character of her identity and the reasons for her hatred towards him (see Syrio Forel, Episode 1x8), punctuated with further non-fatal stabbings, before finally finishing character off by cutting his throat."
	},
	{
		"quote": "I do. I know. About you and Mother. I think a part of me always knew. And...I'm glad. I'm glad you're my father.",
		"who": "Myrcella Baratheon",
		"source": "Episode 5x10",
		"note": "Character is returning to King's Landing with Ser Jaime, who begins to reveal to character that he, not King Robert, is her father. Character responds with the above, revealing that she already knew. Shortly thereafter, she collapses and dies. It is then revealed that character was given a slow-acting poison upon her departure by Ellaria Sand, to gain vengeance for the death of Oberyn Martell (Episode 4x8)."
	},
	{
		"quote": "Olly...",
		"who": "Jon Snow",
		"source": "Episode 5x10",
		"note": "Character has been lured into an ambush, and then stabbed by Ser Alliser Thorne and several other Night's Watch brothers, 'for the Watch', over his controversial decision to allow wildlings through the Wall. Finally, character is approached by Olly, prompting the above, before Olly stabs him as well. The brothers then leave character bleeding out in the snow."
	},
	{
		"quote": "My son...Trystane...",
		"who": "Doran Martell",
		"source": "Episode 6x1",
		"note": "Character receives news from a Maester that Myrcella is dead. Before he can fully comprehend the message's contents, Tyene Sand kills Areo Hotah with a dagger to the back and Ellaria stabs Doran in the chest with a concealed knife. After a light struggle, Doran collapses, eventually bleeding out as Ellaria brands him and his son as weak, declaring that 'weak men' will never rule Dorne again."
	},															
	{
		"quote": "You.",
		"who": "Trystane Martell",
		"source": "Episode 6x1",
		"note": "Character is approached by Nymeria and Obara Sand, who have stolen away on board his ship with the intent to kill him. Despite his reluctance to fight, Nymeria asks twice who he would rather have kill him - her, or her sister. Character draws his sword and says the above in response, but Obara soon runs the blade of her spear through his head, killing him instantly."
	},	
	{
		"quote": "You'll always be my firstborn.'",
		"who": "Roose Bolton",
		"source": "Episode 6x2",
		"note": "Character has just received the news that his wife has given birth to a son. After receiving the congratulations of his legitimized bastard son, Ramsay (who the new child could displace as heir), character says the above to reassure him. With the question of inheritance seemingly settled, Ramsay then stabs character to death."
	},
	{
		"quote": "Please, Ramsay. He's your brother.",
		"who": "Walda Frey/Bolton",
		"source": "Episode 6x2",
		"note": "After being lured into the Winterfell kennels, character has just been told by Ramsay Bolton about Roose's death, thus making it clear that she and her newborn son are also to be killed to eliminate the threat they pose to Ramsay. Character tries to plead for her son's life with the above, but Ramsay replies that he preferred being an only child, and sets the dogs loose on both."
	},
	{
		"quote": "What kind of an Ironborn loses his senses during a storm?",
		"who": "Balon Greyjoy",
		"source": "Episode 6x2",
		"note": "Character has just encountered his hated and exiled younger brother, Euron, on a bridge in Pyke. Character insults his brother by recounting a tale he had heard of Euron losing his mind when his ship was caught in a storm. Euron replies that he has become the storm, and throws character off the bridge to his death."
	},
	{
		"quote": "Your friend the Usurper'd lie beneath the ground if we had been.'",
		"who": "Ser Gerold Hightower",
		"source": "Episode 6x3",
		"note": "In a flashback seen by Bran Stark, Eddard Stark has questioned the absence of character and his fellow Kingsguard Arthur Dayne at the pivotal Battle of the Trident. Character responds with the above line, and is later killed by Eddard in the ensuing fight."
	},
	{
		"quote": "I wish you good fortune in the wars to come. And now it begins.",
		"who": "Ser Arthur Dayne",
		"source": "Episode 6x3",
		"note": "In a flashback seen by Bran Stark, Eddard Stark has questioned why character remained at the Tower of Joy, rather than taking part in the pivotal events that led to the deaths of his king and prince, and the end of the Targaryen dynasty. Character makes it clear that he has been following the orders of Rhaegar Targaryen, and that he will continue to do so even though Rhaegar is now dead. Character then says the above, acknowledging his respect for Eddard, but also the certainty that they must now fight to the death. In the ensuing battle, character kills or wounds all of Eddard's companions and disarms Eddard himself, before being stabbed through the neck by Howland Reed, and then killed by Eddard."
	},
	{
		"quote": "You shouldn't be alive. It's not right.'",
		"who": "Bowen Marsh",
		"source": "Episode 6x3",
		"note": "Character has been sentenced to hang for his part in the murder of Jon Snow, who (after being brought back to life) asks character for his final words. Character says the above, to which Jon replies that neither was killing him. Character then hangs along with his fellow conspirators."
	},
	{
		"quote": "My mother's still living in White Harbor. Could you write her? Tell her I died fighting the Wildlings.",
		"who": "Othell Yarwyck",
		"source": "Episode 6x3",
		"note": "Character has been sentenced to hang for his part in the murder of Jon Snow, who (after being brought back to life) asks character for his final words. Jon makes no reply to character's request to lie for him, and then hangs him along with his fellow conspirators."
	},
	{
		"quote": "I had a choice, ''Lord Commander'': betray you, or betray the Night's Watch. You brought an army of Wildlings into our lands. An army of murderers and raiders. If I had to do it all over, knowing where I'd end up, I pray I'd make the right choice again.' ''[Jon: I'm sure you would, Ser Alliser.]'' 'I fought. I lost. Now I rest. But you, ''Lord Snow'', you'll be fighting their battles forever.",
		"who": "Ser Alliser Thorne",
		"source": "Episode 6x3",
		"note": "Character has been sentenced to hang for his part in the murder of Jon Snow, who (after being brought back to life) asks character for his final words. Character responds with the above, showing his lack of remorse and continuing conviction that he did the right thing. Jon then hangs him along with his fellow conspirators."
	},
	{
		"quote": "That so?'",
		"who": "Osha",
		"source": "Episode 6x4",
		"note": "Character, being asked why she was with Rickon Stark, is attempting to seduce Ramsay Bolton whilst simultaneously reaching for a nearby knife. Character, who claims that she intended to betray Rickon, says the above in response to him claiming that she talked faster than Theon. He sees through her ruse, revealing that Theon told him everything he needed to know (including how she used the same ruse on him). She grabs the knife, but Ramsay stabs her in the neck before she can react, and she succumbs to her injury."
	},
	{
		"quote": "Alright. No Dosh Khaleen for you. Instead, we'll take turns fucking you. And then we'll let our bloodriders fuck you. And if there's anything left of you, we'll give our horses a turn. You crazy cunt. Did you really think we would serve you?",
		"who": "Khal Moro",
		"source": "Episode 6x4",
		"note": "Character has brought Daenerys before all of the khals to decide her fate. Daenerys ridicules their small ambitions and declares she will lead the Dothraki, since they are all unfit. Character responds with laughter and the above, mocking her along with the other khals. Daenerys in turn states that they will not serve, but will die instead. She then knocks over the braziers in the hut (the doors of which have been barred by her friends), and burns the khals in a massive fire from which she then emerges unburnt."
	},
	{
		"quote": "The time has come. Leave me.",
		"who": "The Three-Eyed Raven",
		"source": "Episode 6x5",
		"note": "Said to Bran as the two share a final weirwood vision. Character's physical body is then killed by the Night's King, causing him to disappear from the vision."
	},
	{
		"quote": "Go!",
		"who": "Leaf",
		"source": "Episode 6x5",
		"note": "While fleeing from the wights and White Walkers, character says the above as she stops to try and delay the pursuit, buying time for Meera and Hodor to escape with Bran. Character then drops a firebomb into the pursuing wights as they hack her to death."
	},
	{
		"quote": "Hodor.",
		"who": "Hodor",
		"source": "Episode 6x5",
		"note": "The first line is technically character's last quote chronologically, said enthusiastically in response to Meera's description of the foods she hopes to find after they leave the cave. The second line is the last that we hear, though it is actually uttered approximately thirty years earlier. While attempting to flee with Bran, character is told to 'hold the door' by Meera. Bran, whose consciousness is divided between warging Hodor in the present and a vision of the past which includes a young Hodor, hears Meera while his mind is connected to Hodor's. This causes young Hodor to have a seizure, during which he frantically shouts the above, as this command is so implanted in his mind that he becomes incapable of saying anything but his own form of it. As Bran realizes the truth of his vision, in the present character carries out the command that has dominated his mind for decades, holding the back door to the Three-eyed Raven's cave closed against a horde of wights, until they finally begin to break through and tear him apart."
	},
	{
		"quote": "I'll save you a bowl of soup. Might even have some ale hidden away.'",
		"who": "Septon Ray",
		"source": "Episode 6x7 ",
		"note": "Said to Sandor Clegane as character leaves for dinner. Sandor remains chopping firewood, and later returns to find character hung, and his entire village slaughtered, by a group of outlaws."
	},
	{
		"quote": "Go on, now! I haven't had a proper swordfight in years. I expect I'll make a damn fool of myself.",
		"who": "Brynden 'Blackfish' Tully",
		"source": "Episode 6x8",
		"note": "After being forced by his nephew and lord, Edmure Tully, to surrender Riverrun, character helps Brienne and Podrick escape. He chooses to remain and die fighting in his family home rather than leave with them or be captured by the Lannisters and Freys. His final fight and fate are not shown, however his death is later reported to Jaime Lannister."
	},
	{
		"quote": "Please don't. I'll give you anything!",
		"who": "Lem",
		"source": "Episode 6x8",
		"note": "Character, the leader of the outlaws who murdered Septon Ray and his village (see episode 6x7), has been captured by Beric Dondarrion, Thoros of Myr, and the Brotherhood Without Banners (which he once belonged to) and is set to be hung along with his accomplices. Sandor Clegane, in pursuit of the outlaws for revenge, comes upon the hanging and demands the right to kill them himself. Beric and Thoros agree to let him kill two of the three, on the condition that he hang the outlaws as they would do, rather than butcher them with his axe. Character, the second of Sandor's two kills, says the above in an attempt to beg for his life. Sandor ignores him and unceremoniously kicks away the stump holding character under the noose, leaving him to slowly strangle."
	},															
	{
		"quote": "Sleep is the only way you'll heal. Trust me, if my soup didn't kill you, nothing will.",
		"who": "Lady Crane",
		"source": "Episode 6x8",
		"note": "Character, an actress whom Arya Stark was assigned to kill by the Faceless Men, but befriended instead, has now taken Arya in and cared for her after she was attacked by the Waif for failing her mission. Character says the above as she gives Arya milk of the poppy to help her sleep; Arya later awakens to find that character has been killed in gruesome fashion by the Waif."
	},	
	{
		"quote": "Haven't we been through this already? That won't help you.",
		"who": "The Waif",
		"source": "Episode 6x8 ",
		"note": "Character has been sent to kill Arya after she fails to assassinate Lady Crane. Arya leads her in a chase through Braavos, ending in a windowless dead-end room with a single candle. Arya draws her hidden sword Needle, prompting the above from character in reference to the numerous times they have sparred, with character inevitably winning easily. As character advances, Arya closes her eyes and then cuts the head off the candle, plunging the room into total darkness and forcing them both to fight blind (which character has never had to do, but Arya has). The next scene reveals the outcome: character's face added to the House of Black and White, and Arya alive and determined to return home."
	},
	{
		"quote": "He's not one of us - he's an outsider, low-born! He does not speak for us.",
		"who": "Razdal mo Eraz",
		"source": "Episode 6x9",
		"note": "Character and two other representatives of the Masters have approached Daenerys and her inner circle, attempting to force her into surrendering. Drogon appears and interrupts the proceedings, and as he and his escaped brothers lay waste to the largest ships in the Masters' fleet and the forces of the Sons of the Harpy are butchered by the Dothraki under Daario's command, Tyrion and Missandei inform the Masters that one of them must die, as punishment for violating their agreement. Character offers Yezzan as a sacrifice, saying the above as he does so, only for Grey Worm to kill him and the third Master instead by slicing their throats open."
	},
	{
		"quote": "Who owns the North?' ''[Bolton soldiers: We do!]'' 'Who owns the North?!' ''[Bolton soldiers: We do!]'' 'Show me!'",
		"who": "Lord 'Smalljon' Umber",
		"source": "Episode 6x9 ",
		"note": "Character is participating in the battle of Winterfell, leading his troops directly. In the middle of the engagement as Jon Snow's forces are increasingly hemmed in, character shouts the above to his soldiers as a rallying cry before charging into the remnants of the Stark-Wildling forces over a mound of corpses. As the Bolton spearmen close in on the trapped ranks of Snow's forces, character engages Tormund Giantsbane in physical combat, initially beating him into submission before a second wind allows him to bite into character's throat and stab him to death."
	},
	{
		"quote": "''Sit.'' Down. Down! Down! ''Down!'' ''Down!'",
		"who": "Ramsay Bolton",
		"source": "Episode 6x9",
		"note": "Character has had his army broken in the battle at Winterfell, and has been defeated by Jon in single combat. After being knocked out and almost beaten to death, character awakens in Winterfell's kennels, bound to a chair with Sansa watching him. The two converse, and he taunts her, confident that she won't harm him. As Sansa replies, claiming that his house, name and memory will vanish, his hounds walk out of the kennels to surround him - hounds deliberately starved by character so that they would feed on Jon and his advisors after the battle. As he asserts that they won't harm him, Sansa reminds him of their hunger, and character says the above to attempt to control one of his hounds as it licks and sniffs his bloodstained face. Suddenly the hound bites in, and two more quickly follow suit as character is swiftly devoured."
	},
	{
		"quote": "What's the meaning of this? I was told that...ah. I have more important things to do with my time than waste them in the presence...",
		"who": "Grand Maester Pycelle",
		"source": "Episode 6x10",
		"note": "On the way to Cersei and Loras' trial, character is stopped by one of Qyburn's little birds who redirects him to his laboratory. Assuming Tommen had been kept there for safe keeping and that he had been sent to fetch him, character finds no-one in the laboratory save Qyburn himself and the rest of his birds. Character questions him on the king's whereabouts, then says the above before Qyburn apologizes to him and asks him for forgiveness. As his birds brandish knives, he tells character that although he does not deserve to die in such a place, the old must be 'put to rest' before that which is new can be ushered in. Immediately after, the birds attack him, overwhelm him and stab him to death."
	},
	{
		"quote": "What are you doing?!",
		"who": "Lancel Lannister",
		"source": "Episode 6x10",
		"note": "Character has been dispatched by the High Sparrow to bring Cersei to her impending trial. Finding himself sidelined by one of Qyburn's 'little birds', he follows him into a dark hallway that leads to a massive stockpile of wildfire. As he tries to find him in the darkness, the boy leaps from the shadows and stabs him in his spine, paralyzing him. Character says the above as his assailant briefly kneels over him before running off, and upon seeing three lights down the hall he crawls towards them. As he approaches, he discovers the lights are candles burning down in pools of wildfire as a primitive time bomb, but he reaches the candles too late to extinguish them and he is incinerated in the resulting explosion."
	},
	{
		"quote": "If the accused is not here, she will be tried regardless. We cannot escape the justice of the gods!",
		"who": "High Sparrow",
		"source": "Episode 6x10",
		"note": "After Loras' trial, as the congregation wait for the arrival of Cersei and Tommen, Margaery questions character with regards to their absence who says the above in response. Margaery ignores his reply and attempts to implore him to listen to reason and let them leave. As the Faith Militant blocks those within from leaving, character, growing increasingly unnerved, exchanges glances with Margarery and Loras, until after a distant rumbling wildfire rips through the floor of the Sept and incinerates character instantly, along with everyone else inside."
	},
	{
		"quote": "I will.'",
		"who": "Loras Tyrell",
		"source": "Episode 6x10",
		"note": "Character is undergoing his trial in the Great Sept of Baelor, freely confessing to his crime of homosexuality, pleading for clemency by forfeiting his noble status and all claims on Highgarden and pledging to join the Faith Militant. Character says the above as the High Sparrow seeks final affirmation of his penitence from him, and a member of the Faith Militant carves the symbol of the Faith into his forehead as a mark of atonement. Later, when Cersei fails to appear for her trial and Margaery suspects something is amiss, he and Margaery try to leave the Sept, but the way is blocked by Militant members. As the crowd tries to exit the Sept, he and Margaery stare at the High Sparrow, and they are immolated moments later when wildfire tears through the building, killing all inside."
	},
	{
		"quote": "No, I can't let them!'",
		"who": "Mace Tyrell",
		"source": "Episode 6x10",
		"note": "Character is observing his son's trial, watching the conclusion of the proceedings. As proof of his penance, a member of the Faith Militant begins to carve the symbol of the Faith into Loras' forehead. Character says the above as he tries to interrupt, but Margaery restrains and placates him. The Sept is later obliterated by an explosion of wildfire, killing character and everyone else inside."
	},
	{
		"quote": "Let us through!",
		"who": "Margaery Tyrell",
		"source": "Episode 6x10",
		"note": "In the absence of Cersei and Tommen ahead of the former's trial, character attempts to reason with the High Sparrow, questioning Cersei not being present despite her being aware of the consequences of being absent. Declaring that something is amiss and that they need to leave, character and Loras make for the exit, but members of the Faith Militant block the Sept's occupants from leaving. Character says the above to two Faith Militant guards who bar her way, and as the crowd try to force their way out of the Sept she and Loras stare coldly at the High Sparrow. Moments later, the detonation of wildfire beneath King's Landing consumes the building, killing all within it."
	},
	{
		"quote": "All right, I'm ready.' ''[Sees Gregor Clegane blocking the door.]'' 'I have to go. I'm...I'm late for the trial.",
		"who": "Tommen Baratheon",
		"source": "Episode 6x10",
		"note": "Character, preparing to leave the Red Keep to preside over his mother's trial, is barred from leaving by Gregor. Character says the above as he protests, but he remains confined to the Keep regardless. He later bears witness to the explosion that destroys the Great Sept of Baelor, and realizing his mother is responsible, he sets aside his crown and hurls himself out of a window to his death."
	},
	{
		"quote": "Well, what are they doing? Trimming their cunt hairs? Tell them to come here, now.",
		"who": "Walder Frey",
		"source": "Episode 6x10",
		"note": "Character, having recently celebrated the recapturing of Riverrun, is lunching alone, being tended to by a servant girl. Character questions the absence of his sons Black Walder and Lothar, and says the above when the servant girl claims that they're already there. The servant repeats herself, with character looking increasingly confused until she indicates the pie he is eating, which he takes apart to reveal the flesh of his sons beneath the crust. The servant girl removes her face and reveals herself as Arya Stark, who claims that the last thing he'll ever see is a Stark smiling down at him as he dies, with her fulfilling her pledge moments later as she slices character's throat open and watches him choke on his own blood."
	},
	{
		"quote": "Listen to me, Ned.' ''[whispers in his ear]'' 'His name is' <too soft to hear>'. If Robert finds out, he'll kill him, you know he will. You have to protect him. Promise me, Ned. Promise me.' ''[Ned is handed a baby, Lyanna's son]'' 'Promise me, Ned. Promise me.'",
		"who": "Lyanna Stark",
		"source": "Episode 6x10",
		"note": "In Bran's weirwood vision, the continuation of the events at the Tower of Joy some 17 years previously (see s6e3), character is found dying in a [[w:Childbirth#Complications|bloody bed]] by her brother, Ned Stark. Ned is shown a baby, [[w:Jon_Snow_(character)#Parentage|Lyanna's son with Rhaegar Targaryen]]. Character tells Ned the child's name (too softly to hear), and begs Ned to promise her that he will protect him, before finally dying from complications of the childbirth. The camera settles on a close-up shot of the baby's face, before cutting to an identical shot of Jon Snow in the present, indicating that he is the baby from the flashback."
	}
]

